import React from 'react';
import '../App.css';  // Імпорт стилів

function AboutMe() {
  return (
    <div>
      <h1>Про мене</h1>
      <p>Привіт! Мене звуть Гаврилюк Нікіта Васильович, я студент 2 курсу Київського Національного університету біоресурсів і природокористування (НУБіП), факультет Інформаційних технологій, спеціальність "Комп'ютерні науки". Я навчаюсь у групі КН23001Б. Маю великий інтерес до програмування, зокрема до розробки веб-додатків за допомогою JavaScript та React. Вже з початку навчання я захопився розробкою та прагну створювати інноваційні і ефективні рішення.</p>
      <p>Моя мета — стати професіоналом у сфері веб-розробки, працюючи з сучасними інструментами та технологіями, а також постійно вдосконалювати свої навички.</p>

      <h2>Мої цінності та захоплення:</h2>
      <p>Вірю в постійне самовдосконалення та навчання. Програмування дозволяє мені вирішувати складні задачі і допомагати іншим завдяки технологіям. В позаурочний час цікавлюсь новими тенденціями в програмуванні, штучним інтелектом та машинним навчанням.</p>
      
      <h2>Мої проєкти:</h2>
      <p>Під час навчання я створив декілька проєктів, котрі допомогли мені розвивати свої навички веб-розробки:</p>
      <ul>
        <li><strong>HTML + CSS:</strong> <a href="https://github.com/nhavryliuk/html-css-landing" target="_blank" rel="noopener noreferrer">Проєкт 1</a></li>
        <li><strong>JavaScript:</strong> <a href="https://github.com/nhavryliuk/js-array" target="_blank" rel="noopener noreferrer">Проєкт 2</a></li>
        <li><strong>React:</strong> <a href="https://github.com/nhavryliuk/react-first-lab" target="_blank" rel="noopener noreferrer">Проєкт 3</a></li>
      </ul>

      <h2>Моє бачення майбутнього:</h2>
      <p>Моя мета — стати висококласним розробником, створюючи ефективні рішення з використанням сучасних веб-технологій. У найближчому майбутньому планую пройти сертифікацію з JavaScript та React, а також стати частиною команди, яка розробляє передові продукти.</p>

      <h3>Моя мета:</h3>
      <p>Стати senior розробником, працювати у технологічній компанії та допомагати вирішувати складні задачі за допомогою програмування та новітніх технологій.</p>
    </div>
  );
}

export default AboutMe;
