import React from 'react';

function MyFuture() {
  return (
    <div>
      <h1>Мій розвиток</h1>
      <h2>3 кроки до мого майбутнього</h2>
      <ol>
        <li>Отримати професійну сертифікацію з JavaScript.</li>
        <li>Навчитися розробляти складніші SPA на React.</li>
        <li>Стати senior розробником у компанії з передовими технологіями.</li>
      </ol>
      <h3>Мотиваційна фраза:</h3>
      <p>"Не бійтеся помилок, вони — це частина вашого шляху до успіху."</p>
    </div>
  );
}

export default MyFuture;
